packages/ws/src/Resources/wsdl/billService.ns1.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp200409="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsp200607="http://www.w3.org/2006/07/ws-policy" xmlns:ns0="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" xmlns:ns1="http://service.sunat.gob.pe" targetNamespace="http://service.sunat.gob.pe">
<wsdl:types xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<xsd:schema>
<xsd:import schemaLocation="billService.xsd2.xsd" namespace="http://service.sunat.gob.pe"/></xsd:schema></wsdl:types>
<wsdl:message name="getStatus">
<wsdl:part name="parameters" element="xsns:getStatus" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="getStatusResponse">
<wsdl:part name="parameters" element="xsns:getStatusResponse" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="sendBill">
<wsdl:part name="parameters" element="xsns:sendBill" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="sendBillResponse">
<wsdl:part name="parameters" element="xsns:sendBillResponse" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="sendPack">
<wsdl:part name="parameters" element="xsns:sendPack" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="sendPackResponse">
<wsdl:part name="parameters" element="xsns:sendPackResponse" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="sendSummary">
<wsdl:part name="parameters" element="xsns:sendSummary" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:message name="sendSummaryResponse">
<wsdl:part name="parameters" element="xsns:sendSummaryResponse" xmlns:xsns="http://service.sunat.gob.pe"/></wsdl:message>
<wsdl:portType name="billService">
<wsdl:operation name="getStatus">
<wsdl:input name="getStatusRequest" message="ns1:getStatus"/>
<wsdl:output name="getStatusResponse" message="ns1:getStatusResponse"/></wsdl:operation>
<wsdl:operation name="sendBill">
<wsdl:input name="sendBillRequest" message="ns1:sendBill"/>
<wsdl:output name="sendBillResponse" message="ns1:sendBillResponse"/></wsdl:operation>
<wsdl:operation name="sendPack">
<wsdl:input name="sendPackRequest" message="ns1:sendPack"/>
<wsdl:output name="sendPackResponse" message="ns1:sendPackResponse"/></wsdl:operation>
<wsdl:operation name="sendSummary">
<wsdl:input name="sendSummaryRequest" message="ns1:sendSummary"/>
<wsdl:output name="sendSummaryResponse" message="ns1:sendSummaryResponse"/></wsdl:operation></wsdl:portType></wsdl:definitions>